TEXT_RST = '''
Ой, кажется, что ты уже проходил регистрацию…

Если ты хочешь пройти тестирование вновь и поменять данные, нажми заново /start'''

TEXT_START = '''
Привет! 
Мы студенты колледжа "Singularity Hub" очень рады твоему визиту к нам!😁
Мы знаем, что сейчас ты находишься на нашем дне открытых дверей.
Предлагаем пройти небольшой опрос, чтобы мы познакомились с тобой поближе!😉

Записывай все ответы текстом :)
Если ты увидел(а), что допустил(а) ошибку в ответах, просто напиши 🤫 /start'''

TEXT_NAME = '''
Твои фамилия и имя (сначала фамилия, потом имя)
Пример: Достоевский Фёдор'''

TEXT_EMAIL = '''
Твоя электронная почта📠
(Пожалуйста, проверь, что нет ошибок)'''

TEXT_NUMBER = '''
Твой номер телефона📲
(Начиная с 8, без пробелов — 89935679812)
'''

TEXT_SCHOOL = '''
Из какой ты школы?🏫
(Пример: Лицей 44 / Гимназия 1 / Школа 53)'''

TEXT_CLASS = '''
Какой класс ты заканчиваешь в этом году?⚡️
(Пример: 9)'''

TEXT_NAME_PARENTS = '''Имя и отчество одного из родителей👩🧔'''

TEXT_NUMBER_PARENTS = '''Телефон родителя, имя которого ты указал/указала выше🤙'''

TEXT_NEXT = '''
Ты был/была на каких-либо мероприятиях от Skyeng или колледжа Singularity Hub?😎

- ДА
- НЕТ
'''

TEXT_END = '''
Ты бы хотел/хотела попасть в IT-колледж Singularity Hub?😏

- ДА, хочу, обсуждал/обсуждала с родителями
- ДА, но не обсуждал/обсуждала с родителями
- Не знаю
- НЕТ, не хотел/хотела бы
- Что такое Singularity Hub?
'''

TEXT_TOTAL = '''
У тебя появляется уникальная возможность внести себя в список предварительной записи в наш образовательный центр или IT-колледж. 
Это означает, что ты будешь в числе первых, кого мы рассмотрим при начале процесса зачисления.

Внести ли тебя в лист предзаписи в наш образовательный центр/IT-колледж?💼

- Да, хочу в образовательный центр
- Да, хочу в IT-колледж
- НЕТ
'''

TEXT_LIST = '''
Проверь, пожалуйста, все ли в порядке.

Фамилия/Имя: {}
Твоя почта: {}
Твой номер: {}
Школа: {}
Твой класс: {}
Имя/Отчество одного из родителей: {}
Номер телефона у одного из родителей: {}

И последний вопрос, ответь, все ли верно?☺️
'''

TEXT_REGIST = '''
Благодарим тебя за регистрацию😍

https://t.me/itfuture_cheboksary - присоединяйся в наше IT-сообщество, чтобы быть всегда в курсе всех наших активностей 

Мы ждем тебя в мире IT🧑‍💻
'''

TEXT_ANSWER = '''Попробуй ещё раз'''

TEXT_REST = '''Хорошо, давай начнём регистрацию заново'''

TEXT_MAIN_FEEEDBACK = '''
Благодарим Вас за посещение образовательного центра «Singularity Hub» 🧑‍💻 

https://t.me/itfuture_cheboksary - присоединяйся в наше IT-сообщество, чтобы быть всегда в курсе всех наших активностей 

Мы ждем тебя в мире IT🧑‍💻

👇 
<a href="https://clck.ru/39TCLB">ссылка на чат с преподавателем для ИТ-урока</a>
'''

TEXT_ANSWER_FEEDBACK = '''
Каждый день мы стараемся становиться лучше
Будем рады, если у Вас получится уделить 1 минуту вашего времени для того, чтобы дать нам обратную связь

Далее будет 5 вопросов, 4 из них в формате

(Оценка идет по 5-бальной школе, где 1 - очень плохо, 5 - велипно и лучше некуда)

В 5 вопросе можно ответь своими словами
'''

TEXT_FEEDBACK_ONE = '''
1 вопрос:

Оцените, пожалуйста, организацию дня открытых дверей. Хорошо ли была организована программа?
'''

TEXT_FEEDBACK_TWO = '''
2 вопрос:

Оцените, пожалуйста, качество ИТ-урока. 
'''

TEXT_FEEDBACK_THREE = '''
3 вопрос:

Оцените, пожалуйста, проекты наших студентов. Удалось ли им вас впечатлить? 
'''

TEXT_FEEDBACK_FOUR = '''
4 вопрос:

Оцените, пожалуйста, тестирование. Получили ли вы от него пользу?
'''

TEXT_FEEDBACK_FIVE = '''
5 вопрос:

Подскажите, пожалуйста, по времени проведения мероприятия? Вам было удобно в будни в это время? 
(можно написать то время, когда вам было ббы удобнее. Пример №1: лучше проводить по выходным после обеда.
Пример №2: лучше проводить в будни вечером после 17:00)
'''

TEXT_END_FEEDBACK = '''Спасибо за обратную связь'''
